# ScreenPtToModelPt2D

## Description
Transforms a point from screen coordinate in plan rotation to the model coordinates.

```pascal
PROCEDURE ScreenPtToModelPt2D(VAR p : REAL);
```

```python

def vs.ScreenPtToModelPt2D(p):
    return p
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p|REAL|Input output parameter. Coordinates of the point to be translated.|

## Remarks
Takes into account both translation and rotation.

## Version
Availability: from VectorWorks 2008
## Category
* Objects - 2D